//
//  Build settings defined for the external build system
//  English localization
//
//  Copyright (c) 2007-2009 Apple Inc.  All rights reserved.
//

"Name" = "Standard Build Settings";
"Description" = "General";


// Architectures

"[Architectures]-category" = "Architectures";

"[ARCHS]-name" = "Architectures";
"[ARCHS]-description" = "A list of the architectures for which the product will be built.  By default only the native architecture (the one for the machine on which Xcode is running) is produced.  If more than one architecture is specified, a universal binary will be produced. [ARCHS]";

"[VALID_ARCHS]-name" = "Valid Architectures";
"[VALID_ARCHS]-description" = "A space-separated list of architectures for which the target should actually be built. For each target, this list is intersected with the list specified in 'Architectures', and the resulting set is built. This allows individual targets to “opt out” of building for particular architectures. If the resulting set of architectures is empty, no executable will be produced. [VALID_ARCHS]";

// Standard build paths

"[Build Locations]-category" = "Build Locations";

"[SDKROOT]-name" = "Base SDK";
"[SDKROOT]-description" = "The name or path of the base SDK being used during the build. The product will be built against the headers and libraries located inside the indicated SDK. This path will be prepended to all search paths, and will be passed through the environment to the compiler and linker. Additional SDKs can be specified in the ADDITIONAL_SDKS setting.  [SDKROOT]";

"[ADDITIONAL_SDKS]-name" = "Additional SDKs";
"[ADDITIONAL_SDKS]-description" = "The locations of any sparse SDKs that should be layered on top of the one specified by SDKROOT. If more than one SDK is listed, the first one has highest precedence. Every SDK specified in this setting should be a \"sparse\" SDK, i.e. not an SDK for an entire Mac OS X release.  [ADDITIONAL_SDKS]";

"[SYMROOT]-name" = "Build Products Path";
"[SYMROOT]-description" = "The path at which all products will be placed when performing a build. Typically this path is not set per target, but is set per-project or per-user. By default, this is set to $(PROJECT_DIR)/build.  [SYMROOT]";

"[OBJROOT]-name" = "Intermediate Build Files Path";
"[OBJROOT]-description" = "The path where intermediate files will be placed during a build. Intermediate files include generated sources, object files, etc. Shell script build phases can place and access files here, as well. Typically this path is not set per target, but is set per-project or per-user. By default, this is set to $(PROJECT_DIR)/build.  [OBJROOT]";

"[CONFIGURATION_BUILD_DIR]-name" = "Per-configuration Build Products Path";
"[CONFIGURATION_BUILD_DIR]-description" = "The base path where build products will be placed during a build for a given configuration. By default this is set to $(BUILD_DIR)/$(CONFIGURATION).  [CONFIGURATION_BUILD_DIR]";

"[CONFIGURATION_TEMP_DIR]-name" = "Per-configuration Intermediate Build Files Path";
"[CONFIGURATION_TEMP_DIR]-description" = "The base path where intermediates will be placed during a build for a given configuration. By default this is set to $(PROJECT_TEMP_DIR)/$(CONFIGURATION).  [CONFIGURATION_TEMP_DIR]";

"[SHARED_PRECOMPS_DIR]-name" = "Precompiled Headers Cache Path";
"[SHARED_PRECOMPS_DIR]-description" = "The path where precompiled prefix header files are placed during a build. Defaults to _CS_DARWIN_USER_CACHE_DIR/com.apple.Xcode.$(UID)/SharedPrecompiledHeaders. Using a global location allows precompiled headers to be shared between multiple projects.  [SHARED_PRECOMPS_DIR]";

// Search Paths Settings

"[Search Paths]-category" = "Search Paths";

"[HEADER_SEARCH_PATHS]-name" = "Header Search Paths";
"[HEADER_SEARCH_PATHS]-description" = "This is a list of paths to folders to be searched by the compiler for included or imported header files when compiling C, Objective-C, C++, or Objective-C++. Paths are delimited by whitespace, so any paths with spaces in them need to be properly quoted. [HEADER_SEARCH_PATHS, -I]";

"[USER_HEADER_SEARCH_PATHS]-name" = "User Header Search Paths";
"[USER_HEADER_SEARCH_PATHS]-description" = "This is a list of paths to folders to be searched by the compiler for included or imported user header files (those headers listed in quotes) when compiling C, Objective-C, C++, or Objective-C++. Paths are delimited by whitespace, so any paths with spaces in them need to be properly quoted. See the description of the \"Always Search User Paths\" build setting for more details on how this setting is used. If the compiler doesn't support the concept of user headers, then the search paths are prepended to the any existing header search paths defined in \"Header Search Paths\". [USER_HEADER_SEARCH_PATHS, -iquote]";

"[LIBRARY_SEARCH_PATHS]-name" = "Library Search Paths";
"[LIBRARY_SEARCH_PATHS]-description" = "This is a list of paths to folders to be searched by the linker for libraries used by the product. Paths are delimited by whitespace, so any paths with spaces in them need to be properly quoted. [LIBRARY_SEARCH_PATHS, -L]";

"[FRAMEWORK_SEARCH_PATHS]-name" = "Framework Search Paths";
"[FRAMEWORK_SEARCH_PATHS]-description" = "This is a list of paths to folders containing frameworks to be searched by the compiler for both included or imported header files when compiling C, Objective-C, C++, or Objective-C++, and by the linker for frameworks used by the product. Paths are delimited by whitespace, so any paths with spaces in them need to be properly quoted. [FRAMEWORK_SEARCH_PATHS, -F]";

"[REZ_SEARCH_PATHS]-name" = "Rez Search Paths";
"[REZ_SEARCH_PATHS]-description" = "This is a list of paths to search for files with resource manager resources. Paths are delimited by whitespace, so any paths with spaces in them need to be properly quoted. [REZ_SEARCH_PATHS, -i]";

"[ALWAYS_SEARCH_USER_PATHS]-name" = "Always Search User Paths";
"[ALWAYS_SEARCH_USER_PATHS]-description" = "If enabled both #include <header.h>-style and #include \"header.h\"-style directives will search the paths in \"User Header Search Paths\" before \"Header Search Paths\", with the consequence that user headers (such as your own String.h header) would have precedence over system headers when using #include <header.h>. This is done using the -iquote flag for the paths provided in \"User Header Search Paths\". If disabled and your compiler fully supports separate user paths, user headers will only be accessible with #include \"header.h\"-style preprocessor directives. 

For backwards compatibility reasons, this setting is enabled by default, but disabling it is strongly recommended. [ALWAYS_SEARCH_USER_PATHS]";

"[INCLUDED_RECURSIVE_SEARCH_PATH_SUBDIRECTORIES]-name" = "Sub-Directories to Include in Recursive Searches";
"[INCLUDED_RECURSIVE_SEARCH_PATH_SUBDIRECTORIES]-description" = "This is a list of fnmatch()-style patterns of file or directory names to include when performing a recursive search. By default this list is empty and is only customized when you want to provide exceptions to the list of filename patterns provided in the \"Sub-Directories to Exclude in Recursive Searches\". [INCLUDED_RECURSIVE_SEARCH_PATH_SUBDIRECTORIES]";

"[EXCLUDED_RECURSIVE_SEARCH_PATH_SUBDIRECTORIES]-name" = "Sub-Directories to Exclude in Recursive Searches";
"[EXCLUDED_RECURSIVE_SEARCH_PATH_SUBDIRECTORIES]-description" = "This is a list of fnmatch()-style patterns of file or directory names to exclude when performing a recursive search. By default this list is set to \"*.nib *.lproj *.framework *.gch *.xcode (*) CVS .svn .git\". Normally, if you override this value you should make sure to include the default values via the '$(inherited)' macro. [EXCLUDED_RECURSIVE_SEARCH_PATH_SUBDIRECTORIES]";

// Versioning Settings

"[Versioning]-category" = "Versioning";

"[VERSIONING_SYSTEM]-name" = "Versioning System";
"[VERSIONING_SYSTEM]-description" = "Selects the process used for version-stamping generated files. [VERSIONING_SYSTEM]

None - Use no versioning system. []
Apple Generic - Use the current project version setting. [apple-generic]";
"[VERSIONING_SYSTEM]-value-[]" = "None";
"[VERSIONING_SYSTEM]-description-[]" = "Use no versioning system.";
"[VERSIONING_SYSTEM]-value-[apple-generic]" = "Apple Generic";
"[VERSIONING_SYSTEM]-description-[apple-generic]" = "Use the current project version setting.";

"[CURRENT_PROJECT_VERSION]-name" = "Current Project Version";
"[CURRENT_PROJECT_VERSION]-description" = "This setting defines the the current version of the project. The value must be a integer or floating point number like 57 or 365.8. [CURRENT_PROJECT_VERSION]";

"[VERSION_INFO_PREFIX]-name" = "Versioning Name Prefix";
"[VERSION_INFO_PREFIX]-description" = "Used as a prefix for the name of the version info symbol in the generated versioning source file.  If you prefix your exported symbols you will probably want to set this to the same prefix. [VERSION_INFO_PREFIX]";

"[VERSION_INFO_SUFFIX]-name" = "Versioning Name Suffix";
"[VERSION_INFO_SUFFIX]-description" = "Used as a suffix for the name of the version info symbol in the generated versioning source file.  This is rarely used. [VERSION_INFO_SUFFIX]";

"[VERSION_INFO_BUILDER]-name" = "Versioning Username";
"[VERSION_INFO_BUILDER]-description" = "This defines a reference to the user performing a build to be included in the generated Apple Generic Versioning stub. Defaults to the value of the 'USER' environment variable. [VERSION_INFO_BUILDER]";

"[VERSION_INFO_EXPORT_DECL]-name" = "Generated Versioning Variables";
"[VERSION_INFO_EXPORT_DECL]-description" = "This defines a prefix string for the version info symbol declaration in the generated Apple Generic Versioning stub. This can be used, for example, to add an optional 'export' keyword to the version symbol declaration. This should rarely be changed. [VERSION_INFO_EXPORT_DECL]";

"[VERSION_INFO_FILE]-name" = "Generated Versioning Source Filename";
"[VERSION_INFO_FILE]-description" = "Used to specify a name for the source file that will be generated by Apple Generic Versioning and compiled into your product.  By default this is set to \"$(PRODUCT_NAME)_vers.c\". [VERSION_INFO_FILE]";

// Build options

"[BuildOptions]-category" = "Build Options";

"[BUILD_VARIANTS]-name" = "Build Variants";
"[BUILD_VARIANTS]-description" = "A list of the build variants of the linked binary which will be produced.  By default only the 'normal' variant is produced.  Other common values include 'debug' and 'profile'. [BUILD_VARIANTS]";

"[DEBUG_INFORMATION_FORMAT]-name" = "Debug Information Format";
"[DEBUG_INFORMATION_FORMAT]-description" = "This setting controls the format of debug information used by the developer tools. [DEBUG_INFORMATION_FORMAT]

Stabs - Object files and linked products will use Stabs as the debug information format. [stabs]
DWARF - Object files and linked products will use DWARF as the debug information format. [dwarf]
DWARF with dSYM File - Object files and linked products will use DWARF as the debug information format, and Xcode will also produce a dSYM file containing the debug information from the individual object files (except that a dSYM file is not needed and will not be created for static library or object file products). [dwarf-with-dsym]";
"[DEBUG_INFORMATION_FORMAT]-value-[stabs]" = "Stabs";
"[DEBUG_INFORMATION_FORMAT]-description-[stabs]" = "Object files and linked products will use Stabs as the debug information format. [stabs]";
"[DEBUG_INFORMATION_FORMAT]-value-[dwarf]" = "DWARF";
"[DEBUG_INFORMATION_FORMAT]-description-[dwarf]" = "Object files and linked products will use DWARF as the debug information format.  A separate symbol repository can optionally be used to store much of this information outside of the binary files. [dwarf]";
"[DEBUG_INFORMATION_FORMAT]-value-[dwarf-with-dsym]" = "DWARF with dSYM File";
"[DEBUG_INFORMATION_FORMAT]-description-[dwarf-with-dsym]" = "Object files and linked products will use DWARF as the debug information format, and Xcode will also produce a dSYM file containing the debug information from the individual object files (except that a dSYM file is not needed and will not be created for static library or object file products). [dwarf-with-dsym]";

"[SCAN_ALL_SOURCE_FILES_FOR_INCLUDES]-name" = "Scan All Source Files for Includes";
"[SCAN_ALL_SOURCE_FILES_FOR_INCLUDES]-description" = "Activating this setting will cause all source files to be scanned for includes (e.g. of header files) when computing the dependency graph, in which case if an included file is changed then the including file will be rebuilt next time a target containing it is built.  Normally only certain types of files - such as C-language source files - are scanned.

This setting is useful if your project contains files of unusual type which are compiled using a custom build rule.  [SCAN_ALL_SOURCE_FILES_FOR_INCLUDES]";

"[GENERATE_PROFILING_CODE]-name" = "Generate Profiling Code";
"[GENERATE_PROFILING_CODE]-description" = "Activating this setting will cause the compiler and linker to generate profiling code.  E.g., GCC will generate code suitable for use with gprof(1). [GENERATE_PROFILING_CODE]";

"[PRECOMPS_INCLUDE_HEADERS_FROM_BUILT_PRODUCTS_DIR]-name" = "Precompiled Header Uses Files From Build Directory";
"[PRECOMPS_INCLUDE_HEADERS_FROM_BUILT_PRODUCTS_DIR]-description" = "This setting allows for better control of sharing precompiled prefix header files between projects. By default, Xcode assumes that the prefix header file may include header files from the build directory if the build directory is outside of the project directory. (Xcode cannot determine this ahead of time since other projects may not have been built into the shared build directory at the time the information is needed.)

If your prefix file never includes files from the build directory you may set this to \"NO\" to improve sharing of precompiled headers. If the prefix does use files from a build directory which is inside your project directory, you may set this to \"YES\" to avoid unintended sharing that may result in build failures.  [PRECOMPS_INCLUDE_HEADERS_FROM_BUILT_PRODUCTS_DIR]";

// Code-signing Settings
"[Code Signing]-category" = "Code Signing";

"[CODE_SIGN_IDENTITY]-name" = "Code Signing Identity";
"[CODE_SIGN_IDENTITY]-description" = "The name (“common name”) of a valid code-signing certificate in a keychain within your keychain path.   A missing or invalid certificate will cause a build error.  [CODE_SIGN_IDENTITY]";

"[CODE_SIGN_RESOURCE_RULES_PATH]-name" = "Code Signing Resource Rules Path";
"[CODE_SIGN_RESOURCE_RULES_PATH]-description" = "The path to a property list (plist) containing resource scanning instructions to override the default rules for collecting bundle resources to be sealed into the signature. This build setting is optionally used to exclude files that have valid reasons to change after the built executable is code-signed. [CODE_SIGN_RESOURCE_RULES_PATH]";

"[OTHER_CODE_SIGN_FLAGS]-name" = "Other Code Signing Flags";
"[OTHER_CODE_SIGN_FLAGS]-description" = "This build setting allows you to pass any additional options you need to codesign(1) as a single space-delimited string. [OTHER_CODE_SIGN_FLAGS]";

// Linking Settings

"[Linking]-category" = "Linking";

"[MACH_O_TYPE]-name" = "Mach-O Type";
"[MACH_O_TYPE]-description" = "This setting determines the format of the produced binary and how it can be linked when building other binaries. [MACH_O_TYPE]

Executable - Executables and standalone binaries and cannot be linked. [mh_execute]
Dynamic Library - Dynamic libraries are linked at build time and loaded automatically when needed. [mh_dylib]
Bundle - Bundle libraries are loaded explicitly at run time. [mh_bundle]
Static Library - Static libraries are linked at build time and loaded at execution time. [staticlib]
Relocatable Object File - Object files are single-module files which are linked at build time. [mh_object]";
"[MACH_O_TYPE]-value-[mh_execute]" = "Executable";
"[MACH_O_TYPE]-description-[mh_execute]" = "Executables and standalone binaries and cannot be linked. [mh_execute]";
"[MACH_O_TYPE]-value-[mh_dylib]" = "Dynamic Library";
"[MACH_O_TYPE]-description-[mh_dylib]" = "Dynamic libraries are linked at build time and loaded automatically when needed. [mh_dylib]";
"[MACH_O_TYPE]-value-[mh_bundle]" = "Bundle";
"[MACH_O_TYPE]-description-[mh_bundle]" = "Bundle libraries are loaded explicitly at run time. [mh_bundle]";
"[MACH_O_TYPE]-value-[staticlib]" = "Static Library";
"[MACH_O_TYPE]-description-[staticlib]" = "Static libraries are linked at build time and loaded at execution time. [staticlib]";
"[MACH_O_TYPE]-value-[mh_object]" = "Relocatable Object File";
"[MACH_O_TYPE]-description-[mh_object]" = "Relocatable object files are single-module files which are linked at build time. [mh_object]";

"[LINK_WITH_STANDARD_LIBRARIES]-name" = "Link With Standard Libraries";
"[LINK_WITH_STANDARD_LIBRARIES]-description" = "If this setting activated, then the compiler driver will automatically pass its standard libraries to the linker to use during linking.  If desired, this flag can be used to disable linking with the standard libraries, and then individual libraries can be passed as Other Linker Flags. [LINK_WITH_STANDARD_LIBRARIES, -nostdlib]";

"[KEEP_PRIVATE_EXTERNS]-name" = "Preserve Private External Symbols";
"[KEEP_PRIVATE_EXTERNS]-description" = "Activating this setting will preserve private external symbols rather than turning them into static symbols.  This setting is also respected when performing a single-object prelink.  [KEEP_PRIVATE_EXTERNS, -keep_private_externs]";

"[INIT_ROUTINE]-name" = "Initialization Routine";
"[INIT_ROUTINE]-description" = "This is the name of the routine to use for initialization. [INIT_ROUTINE]";

"[PREBINDING]-name" = "Prebinding";
"[PREBINDING]-description" = "This setting determines if prebinding will be attempted by adding -prebind to linker flags, and defaults to being active for all product types except static libraries. [PREBINDING]";

"[ZERO_LINK]-name" = "ZeroLink (Xcode 2.x only)";
"[ZERO_LINK]-description" = "In previous versions of Xcode this build setting skipped linking shared libraries to shorten build time.  It is no longer needed in Xcode 3.0 and later. [ZERO_LINK]";

"[EXPORTED_SYMBOLS_FILE]-name" = "Exported Symbols File";
"[EXPORTED_SYMBOLS_FILE]-description" = "This is a project-relative path to a file that lists the symbols to export. [EXPORTED_SYMBOLS_FILE]";

"[UNEXPORTED_SYMBOLS_FILE]-name" = "Unexported Symbols File";
"[UNEXPORTED_SYMBOLS_FILE]-description" = "This is a project-relative path to a file that lists the symbols not to export. [UNEXPORTED_SYMBOLS_FILE]";

"[SEPARATE_SYMBOL_EDIT]-name" = "Separately Edit Symbols";
"[SEPARATE_SYMBOL_EDIT]-description" = "Activating this setting when the linked product's symbols are to be edited will cause editing to occur via a separate invocation of nmedit(1).  Otherwise editing will occur during linking, if possible. [SEPARATE_SYMBOL_EDIT]";

"[DYLIB_CURRENT_VERSION]-name" = "Current Library Version";
"[DYLIB_CURRENT_VERSION]-description" = "This setting defines the the current version of any framework built by the project. Like \"Current Project Version\", the value must be an integer or floating point number like 57 or 365.8. By default it is set to $(CURRENT_PROJECT_VERSION).";

"[DYLIB_COMPATIBILITY_VERSION]-name" = "Compatibility Version";
"[DYLIB_COMPATIBILITY_VERSION]-description" = "Determines the compatibility version of the resulting library, bundle, or framework binary. [DYLIB_COMPATIBILITY_VERSION]";

"[LD_DYLIB_INSTALL_NAME]-name" = "Dynamic Library Install Name";
"[LD_DYLIB_INSTALL_NAME]-description" = "Sets an internal \"install path\" (LC_ID_DYLIB) in a dynamic library. Any clients linked against the library will record that path as the way dyld should locate this library.  If this option is not specified, then the -o path will be used.  This setting is ignored when building any product other than a dynamic library. [LD_DYLIB_INSTALL_NAME, -install_name]";

"[SECTORDER_FLAGS]-name" = "Symbol Ordering Flags";
"[SECTORDER_FLAGS]-description" = "These flags are typically used to specify options for ordering symbols within segments, for example the -sectorder option to ld.

Generally you should not specify symbol ordering options in Debug or Development configurations, as this will make the linked binary less readable to the debugger.  Use them only in Release or Deployment configurations. [SECTORDER_FLAGS]";

"[ORDER_FILE]-name" = "Order File";
"[ORDER_FILE]-description" = "The path to a file which alters the order in which functions and data are laid out.

For each section in the output file, any symbol in that section that are specified in the order file is moved to the start of its section and laid out in the same order as in the order file.  Order files are text files with one symbol name per line.  Lines starting with a # are comments.  A symbol name may be optionally preceded with its object file leafname and a colon (e.g. foo.o:_foo).  This is useful for static functions/data that occur in multiple files.  A symbol name may also be optionally preceded with the architecture (e.g. ppc:_foo or ppc:foo.o:_foo).  This enables you to have one order file that works for multiple architectures.  Literal c-strings may be ordered by quoting the string in the order file (e.g. \"Hello, world\\n\").

Generally you should not specify an order file in Debug or Development configurations, as this will make the linked binary less readable to the debugger.  Use them only in Release or Deployment configurations. [ORDER_FILE, -order_file]";

"[LD_RUNPATH_SEARCH_PATHS]-name" = "Runpath Search Paths";
"[LD_RUNPATH_SEARCH_PATHS]-description" = "This is a list of paths to be added to the runpath search path list for the image being created.  At runtime, dyld uses the runpath when searching for dylibs whose load path begins with '@rpath/'. [LD_RUNPATH_SEARCH_PATHS, -rpath]";

"[LD_GENERATE_MAP_FILE]-name" = "Write Link Map File";
"[LD_GENERATE_MAP_FILE]-description" = "Activating this setting will cause the linker to write a map file to disk which details all symbols and their addresses in the output image.  The path to the map file is defined by the Path to Link Map File setting. [LD_GENERATE_MAP_FILE, -map]";

"[LD_MAP_FILE_PATH]-name" = "Path to Link Map File";
"[LD_MAP_FILE_PATH]-description" = "This setting defines the path to the map file written by the linker when the Write Link Map File setting is activated.  By default a separate file will be written for each architecture and build variant, and these will be generated in the Intermediates directory for the target whose produce is being linked. [LD_MAP_FILE_PATH, -map]";

"[WARNING_LDFLAGS]-name" = "Warning Linker Flags";
"[WARNING_LDFLAGS]-description" = "These flags are passed with linker invocations, and by default give the -no_arch_warnings flag to the linker to avoid many warnings being generated during multi-architecture builds. [WARNING_LDFLAGS]";

"[OTHER_LDFLAGS]-name" = "Other Linker Flags";
"[OTHER_LDFLAGS]-description" = "These flags are passed with all linker invocations. [OTHER_LDFLAGS]";

"[DEAD_CODE_STRIPPING]-name" = "Dead Code Stripping";
"[DEAD_CODE_STRIPPING]-description" = "Activating this setting causes the -dead_strip flag to be passed to ld(1) via cc(1) to turn on dead code stripping.  If this option is selected, -gfull (not -gused) must be used to generate debugging symbols in order to have them correctly stripped. [DEAD_CODE_STRIPPING, -dead_strip]";

"[PRESERVE_DEAD_CODE_INITS_AND_TERMS]-name" = "Don't Dead-Strip Inits and Terms";
"[PRESERVE_DEAD_CODE_INITS_AND_TERMS]-description" = "Activating this setting (in combination with the Dead Code Stripping (-dead_strip) option) causes the -no_dead_strip_inits_and_terms flag to be passed to ld(1) via cc(1) to disable dead code stripping for initialization and termination routines.  This option should not be used without the aforementioned Dead Code Stripping option. [PRESERVE_DEAD_CODE_INITS_AND_TERMS, -no_dead_strip_inits_and_terms]";

"[BUNDLE_LOADER]-name" = "Bundle Loader";
"[BUNDLE_LOADER]-description" = "Specifies the executable that will be loading the bundle output file being linked.  Undefined symbols from the bundle are checked against the specified executable like it was one of the dynamic libraries the bundle was linked with. [BUNDLE_LOADER, -bundle_loader]";

"[STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]-name" = "C++ Standard Library Type";
"[STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]-description" = "This setting determines how the C++ standard library (libstdc++) is linked into the final product. [STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]

Dynamic - The binary is linked against the dynamic version of the C++ standard library. This is the default setting. [dynamic]
Static - The binary is linked against the static version of the C++ standard library. For this setting to work properly, the product must be built with 'Symbols Hidden by Default' enabled. Also, statically linking with the C++ standard library will result in a larger binary. [static]";
"[STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]-value-[dynamic]" = "Dynamic";
"[STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]-description-[dynamic]" = "The product is linked against the dynamic version of the C++ standard library. This is the default setting. [dynamic]";
"[STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]-value-[static]" = "Static";
"[STANDARD_C_PLUS_PLUS_LIBRARY_TYPE]-description-[static]" = "The binary is linked against the static version of the C++ standard library. For this setting to work properly, the product must be built with 'Symbols Hidden by Default' enabled. Also, statically linking with the C++ standard library will result in a larger binary. [static]";

"[LINKER_DISPLAYS_MANGLED_NAMES]-name" = "Display Mangled Names";
"[LINKER_DISPLAYS_MANGLED_NAMES]-description" = "Activating this setting causes the linker to display mangled names for C++ symbols.  Normally, this is not recommended, but turning it on can help to diagnose and solve C++ link errors. [LINKER_DISPLAYS_MANGLED_NAMES, --no-demangle]";

"[GENERATE_MASTER_OBJECT_FILE]-name" = "Perform Single-Object Prelink";
"[GENERATE_MASTER_OBJECT_FILE]-description" = "Activating this setting will cause the object files built by a target to be prelinked using 'ld -r' into a single object file, and that object file will then be linked into the final product.  This is useful to force the linker to resolve symbols and link the object files into a single module before building a static library.  Also, a separate set of link flags can be applied to the prelink allowing additional control over (for instance) exported symbols. [GENERATE_MASTER_OBJECT_FILE, -r]";

"[PRELINK_LIBS]-name" = "Prelink libraries";
"[PRELINK_LIBS]-description" = "Additional libraries to pass when performing a single-object prelink. [PRELINK_LIBS]";

"[PRELINK_FLAGS]-name" = "Single-Object Prelink Flags";
"[PRELINK_FLAGS]-description" = "Additional flags to pass when performing a single-object prelink. [PRELINK_FLAGS]";


// Packaging Settings

"[Packaging]-category" = "Packaging";

"[PRODUCT_NAME]-name" = "Product Name";
"[PRODUCT_NAME]-description" = "This is the basename of the product generated. [PRODUCT_NAME]";

"[EXECUTABLE_PREFIX]-name" = "Executable Prefix";
"[EXECUTABLE_PREFIX]-description" = "This is the prefix used for the executable product generated by the target, which has a default value based on the product type. [EXECUTABLE_PREFIX]";

"[EXECUTABLE_EXTENSION]-name" = "Executable Extension";
"[EXECUTABLE_EXTENSION]-description" = "This is the extension used for the executable product generated by the target, which has a default value based on the product type. [EXECUTABLE_EXTENSION]";

"[WRAPPER_EXTENSION]-name" = "Wrapper Extension";
"[WRAPPER_EXTENSION]-description" = "This is the extension used for product wrappers, which has a default value based on the product type. [WRAPPER_EXTENSION]";

"[PRIVATE_HEADERS_FOLDER_PATH]-name" = "Private Headers Folder Path";
"[PRIVATE_HEADERS_FOLDER_PATH]-description" = "This is the location to copy the private headers during building, relative to the built products folder. [PRIVATE_HEADERS_FOLDER_PATH]";

"[PUBLIC_HEADERS_FOLDER_PATH]-name" = "Public Headers Folder Path";
"[PUBLIC_HEADERS_FOLDER_PATH]-description" = "This is the location to copy the public headers during building, relative to the built products folder. [PUBLIC_HEADERS_FOLDER_PATH]";

"[GENERATE_PKGINFO_FILE]-name" = "Force Package Info Generation";
"[GENERATE_PKGINFO_FILE]-description" = "Forces the PkgInfo file to be written to wrapped products even if this file is not expected. [GENERATE_PKGINFO_FILE]";

"[INFOPLIST_FILE]-name" = "Info.plist File";
"[INFOPLIST_FILE]-description" = "This is the project-relative path to the plist file that contains the Info.plist information used by bundles. [INFOPLIST_FILE]";

"[INFOPLIST_PREPROCESS]-name" = "Preprocess Info.plist File";
"[INFOPLIST_PREPROCESS]-description" = "Preprocess the Info.plist file using the C Preprocessor. [INFOPLIST_PREPROCESS]";

"[INFOPLIST_EXPAND_BUILD_SETTINGS]-name" = "Expand Build Settings in Info.plist File";
"[INFOPLIST_EXPAND_BUILD_SETTINGS]-description" = "Expand build settings in the Info.plist file. [INFOPLIST_EXPAND_BUILD_SETTINGS]";

"[INFOPLIST_PREFIX_HEADER]-name" = "Info.plist Preprocessor Prefix File";
"[INFOPLIST_PREFIX_HEADER]-description" = "Implicitly include the given file when preprocessing the Info.plist file. The path given should either be a project relative path or an absolute path. [INFOPLIST_PREFIX_HEADER]";

"[INFOPLIST_PREPROCESSOR_DEFINITIONS]-name" = "Info.plist Preprocessor Definitions";
"[INFOPLIST_PREPROCESSOR_DEFINITIONS]-description" = "Space-separated list of preprocessor macros of the form \"foo\" or \"foo=bar\". These macros are used when preprocessing the Info.plist file. [INFOPLIST_PREPROCESSOR_DEFINITIONS]";

"[INFOPLIST_OTHER_PREPROCESSOR_FLAGS]-name" = "Info.plist Other Preprocessor Flags";
"[INFOPLIST_OTHER_PREPROCESSOR_FLAGS]-description" = "Other flags to pass to the C preprocessor when preprocessing the Info.plist file. [INFOPLIST_OTHER_PREPROCESSOR_FLAGS]";

"[INFOPLIST_OUTPUT_FORMAT]-name" = "Info.plist Output Encoding";
"[INFOPLIST_OUTPUT_FORMAT]-description" = "Specifies the output encoding for the output Info.plist (by default, the output encoding will be unchanged from the input). The output endcodings can be 'binary' or 'XML'.  [INFOPLIST_OUTPUT_FORMAT]";


"[PLIST_FILE_OUTPUT_FORMAT]-name" = "Property List Output Encoding";
"[PLIST_FILE_OUTPUT_FORMAT]-description" = "Specifies the output encoding for Property List (.plist) files (by default, the output encoding will be unchanged from the input). The output endcodings can be 'binary' or 'XML'.  [INFOPLIST_OUTPUT_FORMAT]";


"[STRINGS_FILE_OUTPUT_ENCODING]-name" = "Strings file Output Encoding";
"[STRINGS_FILE_OUTPUT_ENCODING]-description" = "Specify the encoding to be used for Strings files (by default, the output encoding will be 16-bit Unicode).  The value can be either an NSStringEncoding, i.e. one of the numeric values recognized by NSString, or it can be an IANA character set name as understood by CFString.  The operation will fail if the file cannot be converted to the specified encoding. [STRINGS_FILE_OUTPUT_ENCODING]";

"[APPLY_RULES_IN_COPY_FILES]-name" = "Convert Copied Files";
"[APPLY_RULES_IN_COPY_FILES]-description" = "Files copied with a 'Copy Files Build Phase' are unchanged by default.  Setting this to TRUE causes Property Lists (.plist) and Strings files to be converted as specified by 'Property List Output Encoding' and 'Strings file Output Encoding'.. [APPLY_RULES_IN_COPY_FILES]";


"[COPYING_PRESERVES_HFS_DATA]-name" = "Preserve HFS Data";
"[COPYING_PRESERVES_HFS_DATA]-description" = "Causes the copying of resources to preserve resource forks and Finder info. [COPYING_PRESERVES_HFS_DATA]";

"[FRAMEWORK_VERSION]-name" = "Framework Version";
"[FRAMEWORK_VERSION]-description" = "Framework bundles are versioned by having contents in subfolders of a version folder that has links to the current version and its contents. [FRAMEWORK_VERSION]";


// Deployment Settings

"[Deployment]-category" = "Deployment";

"[MACOSX_DEPLOYMENT_TARGET]-name" = "Mac OS X Deployment Target";
"[MACOSX_DEPLOYMENT_TARGET]-description" = "Code will load on this and later versions of Mac OS X.  Framework APIs that are unavailable in earlier versions will be weak-linked; your code should check for null function pointers or specific system versions before calling newer APIs. [MACOSX_DEPLOYMENT_TARGET]

Compiler Default - Code will load on any Mac OS system that supports the APIs that are used.
Mac OS X 10.1 - Code loads on 10.1 (if no 10.2 or 10.3 APIs are used), on 10.2 with weak linking, and 10.3 or later with full linking. [10.1]
Mac OS X 10.2 - Code loads on 10.2 with weak linking, or on 10.3 or later fully linked. [10.2]
Mac OS X 10.3 - Code will not load on systems earlier than 10.3. [10.3]
Mac OS X 10.4 - Code will not load on systems earlier than 10.4. [10.4]
Mac OS X 10.5 - Code will not load on systems earlier than 10.5. [10.5]";
"[MACOSX_DEPLOYMENT_TARGET]-value-[]" = "Compiler Default";
"[MACOSX_DEPLOYMENT_TARGET]-description-[]" = "Code will load on any Mac OS system that supports the APIs that are used.";
"[MACOSX_DEPLOYMENT_TARGET]-value-[10.1]" = "Mac OS X 10.1";
"[MACOSX_DEPLOYMENT_TARGET]-description-[10.1]" = "Code loads on 10.1 (if no 10.2 or 10.3 APIs are used), on 10.2 with weak linking, and 10.3 or later with full linking. [10.1]";
"[MACOSX_DEPLOYMENT_TARGET]-value-[10.2]" = "Mac OS X 10.2";
"[MACOSX_DEPLOYMENT_TARGET]-description-[10.2]" = "Code loads on 10.2 with weak linking, or on 10.3 or later fully linked. [10.2]";
"[MACOSX_DEPLOYMENT_TARGET]-value-[10.3]" = "Mac OS X 10.3";
"[MACOSX_DEPLOYMENT_TARGET]-description-[10.3]" = "Code will not load on systems earlier than 10.3. [10.3]";
"[MACOSX_DEPLOYMENT_TARGET]-value-[10.4]" = "Mac OS X 10.4";
"[MACOSX_DEPLOYMENT_TARGET]-description-[10.4]" = "Code will not load on systems earlier than 10.4. [10.4]";
"[MACOSX_DEPLOYMENT_TARGET]-value-[10.5]" = "Mac OS X 10.5";
"[MACOSX_DEPLOYMENT_TARGET]-description-[10.5]" = "Code will not load on systems earlier than 10.5. [10.5]";

"[DEPLOYMENT_LOCATION]-name" = "Deployment Location";
"[DEPLOYMENT_LOCATION]-description" = "By default built products are placed in the built products folder. Activating this setting indicates that products should be built in their installed locations. [DEPLOYMENT_LOCATION]";

"[DEPLOYMENT_POSTPROCESSING]-name" = "Deployment Postprocessing";
"[DEPLOYMENT_POSTPROCESSING]-description" = "Activating this setting indicates that binaries should be stripped and file mode, owner, and group information should be set to standard values. [DEPLOYMENT_POSTPROCESSING]";

"[DSTROOT]-name" = "Installation Build Products Location";
"[DSTROOT]-description" = "The path at which all products will be rooted when performing an install build.  For instance, to install your products on the system proper, set this path to '/'.  Defaults to /tmp/$(PROJECT_NAME).dst to prevent a \"test\" install build from accidentally overwriting valid and needed data in the ultimate install path.

Typically this path is not set per target, but is provided as an option on the command line when performing an 'xcodebuild install'.  It may also be set in a build configuration in special circumstances.  [DSTROOT]";

"[INSTALL_PATH]-name" = "Installation Directory";
"[INSTALL_PATH]-description" = "The directory to install the build products in. This path is prepended by the 'Installation Build Products Location' (i.e., $(DSTROOT)). [INSTALL_PATH]";

"[SKIP_INSTALL]-name" = "Skip Install";
"[SKIP_INSTALL]-description" = "Activating this setting when deployment locations are used causes the product to be built into an alternative location instead of the install location. [SKIP_INSTALL]";

"[INSTALL_OWNER]-name" = "Install Owner";
"[INSTALL_OWNER]-description" = "The owner name or uid for installed products. [INSTALL_OWNER]";

"[INSTALL_GROUP]-name" = "Install Group";
"[INSTALL_GROUP]-description" = "The group name or gid for installed products. [INSTALL_GROUP]";

"[INSTALL_MODE_FLAG]-name" = "Install Permissions";
"[INSTALL_MODE_FLAG]-description" = "Permissions used for installed product files. [INSTALL_MODE_FLAG]";

"[ALTERNATE_PERMISSIONS_FILES]-name" = "Alternate Permissions Files";
"[ALTERNATE_PERMISSIONS_FILES]-description" = "List of files to which the alternate owner, group and permissions are applied. [ALTERNATE_PERMISSIONS_FILES]";

"[ALTERNATE_OWNER]-name" = "Alternate Install Owner";
"[ALTERNATE_OWNER]-description" = "The owner name or uid for the files listed under the 'Alternate Permissions Files' setting. [ALTERNATE_OWNER]";

"[ALTERNATE_GROUP]-name" = "Alternate Install Group";
"[ALTERNATE_GROUP]-description" = "The group name or gid for the files listed under the 'Alternate Permissions Files' setting. [ALTERNATE_GROUP]";

"[ALTERNATE_MODE]-name" = "Alternate Install Permissions";
"[ALTERNATE_MODE]-description" = "Permissions used for the the files listed under the 'Alternate Permissions Files' setting. [ALTERNATE_MODE]";

"[STRIP_INSTALLED_PRODUCT]-name" = "Strip Linked Product";
"[STRIP_INSTALLED_PRODUCT]-description" = "Activating this setting causes the linked product of the build to be stripped of symbols as part of deployment postprocessing. [STRIP_INSTALLED_PRODUCT]";

"[SEPARATE_STRIP]-name" = "Use Separate Strip";
"[SEPARATE_STRIP]-description" = "Activating this setting when the linked product is to be stripped will cause stripping to occur via a separate invocation of strip(1).  Otherwise stripping will occur during linking, if possible. [SEPARATE_STRIP]";

"[STRIP_STYLE]-name" = "Strip Style";
"[STRIP_STYLE]-description" = "Defines the level of symbol stripping to be performed on the linked product of the build.  The default value is defined by the target's product type. [STRIP_STYLE]

All Symbols - Completely strips the binary, removing the symbol table and relocation information. [all, -s]
Non-Global Symbols - Strips non-global symbols, but saves external symbols. [non-global, -x]
Debugging Symbols - Strips debugging symbols, but saves local and global symbols. [debugging, -S]";
"[STRIP_STYLE]-value-[all]" = "All Symbols";
"[STRIP_STYLE]-description-[all]" = "Completely strips the binary, removing the symbol table and relocation information. [all, -s]";
"[STRIP_STYLE]-value-[non-global]" = "Non-Global Symbols";
"[STRIP_STYLE]-description-[non-global]" = "Strips non-global symbols, but saves external symbols. [non-global, -x]";
"[STRIP_STYLE]-value-[debugging]" = "Debugging Symbols";
"[STRIP_STYLE]-description-[debugging]" = "Strips debugging symbols, but saves local and global symbols. [debugging, -S]";

"[STRIPFLAGS]-name" = "Additional Strip Flags";
"[STRIPFLAGS]-description" = "Additional flags to be passed when stripping the linked product of the build. [STRIPFLAGS]";

"[COPY_PHASE_STRIP]-name" = "Strip Debug Symbols During Copy";
"[COPY_PHASE_STRIP]-description" = "Activating this setting causes binary files which are copied during the build (e.g., in a Copy Bundle Resources or Copy Files build phase) to be stripped of debugging symbols.  It does not cause the linked product of a target to be stripped (use Strip Linked Product for that). [COPY_PHASE_STRIP]";

// Unit Testing Settings

"[UnitTesting]-category" = "Unit Testing";

"[TEST_HOST]-name" = "Test Host";
"[TEST_HOST]-description" = "Path to the executable into which a bundle of unit tests is injected. Only specify this setting if testing an application or other executable. [TEST_HOST]";

"[TEST_RIG]-name" = "Test Rig";
"[TEST_RIG]-description" = "Path to a unit testing tool to use. The tool can take information from its environment and it will be passed the contents of the Other Test Flags build setting as its first few arguments, and the path to a unit test bundle as its final argument. Only specify this setting if using a custom test rig. [TEST_RIG]";

"[OTHER_TEST_FLAGS]-name" = "Other Test Flags";
"[OTHER_TEST_FLAGS]-description" = "Other flags that are passed to the tet rig, before the path to the unit test bundle. [OTHER_TEST_FLAGS]";

// Kernel Module Settings

"[KernelModule]-category" = "Kernel Module";

"[MODULE_NAME]-name" = "Module Identifier";
"[MODULE_NAME]-description" = "This is the identifier of the kernel module listed in the generated stub. This is only used when building kernel extensions. [MODULE_NAME]";

"[MODULE_VERSION]-name" = "Module Version";
"[MODULE_VERSION]-description" = "This is the version of the kernel module listed in the generated stub. This is only used when building kernel extensions. [MODULE_VERSION]";

"[MODULE_START]-name" = "Module Start Routine";
"[MODULE_START]-description" = "This defines the name of the kernel module start routine. This is only used when building kernel extensions. [MODULE_START]";

"[MODULE_STOP]-name" = "Module Stop Routine";
"[MODULE_STOP]-description" = "This defines the name of the kernel module stop routine. This is only used when building kernel extensions. [MODULE_STOP]";

